{"sample_weight_mode": null, "config": [{"config": {"trainable": true, "output_dim": 128, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "batch_input_shape": [null, 481], "input_dim": null, "b_regularizer": null, "bias": true, "W_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "init": "zero", "name": "prelu_1"}, "class_name": "PReLU"}, {"config": {"trainable": true, "output_dim": 32, "activation": "linear", "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "input_dim": null, "b_regularizer": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "init": "zero", "name": "prelu_2"}, "class_name": "PReLU"}, {"config": {"trainable": true, "output_dim": 5, "activation": "softmax", "activity_regularizer": null, "name": "dense_3", "b_constraint": null, "input_dim": null, "b_regularizer": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "optimizer": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "epsilon": 1e-08}, "keras_version": "1.0.6", "loss": "categorical_crossentropy"}